In [1]:
import findspark
findspark.init('/home/realtour/sparkTutorial/spark-2.4.7-bin-hadoop2.7')
#

In [2]:
#notes
"""
how to install mysql jar
# https://dev.mysql.com/get/Downloads/Connector-J/mysql-connector-java_8.0.23-1ubuntu20.10_all.deb
download and run command
sudo dpkg -i mysql-connector-java_8.0.23-1ubuntu20.10_all.deb

after installation checj in cd /usr/share/java/mysql-connector-java-8.0.23.jar
"""

'\nhow to install mysql jar\n# https://dev.mysql.com/get/Downloads/Connector-J/mysql-connector-java_8.0.23-1ubuntu20.10_all.deb\ndownload and run command\nsudo dpkg -i mysql-connector-java_8.0.23-1ubuntu20.10_all.deb\n\nafter installation checj in cd /usr/share/java/mysql-connector-java-8.0.23.jar\n'

In [3]:
#create spark session
import pyspark
from pyspark.sql import SparkSession
from pyspark.sql import SQLContext
import pyspark # only run after findspark.init()

spark = SparkSession \
        .builder \
        .appName('test') \
        .master('local[*]') \
        .config("spark.driver.extraClassPath", "/usr/share/java/mysql-connector-java-8.0.23.jar") \
        .getOrCreate()


spark

In [5]:

titles_df = spark.read.format("jdbc").option("url","jdbc:mysql://localhost:3306/employees").option("driver","com.mysql.jdbc.Driver").option("dbtable","titles").option("user","root").option("password","Meta@123").load()

In [38]:
#create sql view of this df
titles_df.createOrReplaceTempView("titles")

In [7]:
titles_df.printSchema()

root
 |-- emp_no: integer (nullable = true)
 |-- title: string (nullable = true)
 |-- from_date: date (nullable = true)
 |-- to_date: date (nullable = true)

In [26]:
titles_df.limit(5).toPandas()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [42]:
#let display the total record in this table
spark.sql("select count(*) as total_record from titles").show()

+------------+
|total_record|
+------------+
|      443308|
+------------+

In [40]:
spark.sql("select * from titles limit 5").show()

+------+---------------+----------+----------+
|emp_no|          title| from_date|   to_date|
+------+---------------+----------+----------+
| 10001|Senior Engineer|1986-06-26|9999-01-01|
| 10002|          Staff|1996-08-03|9999-01-01|
| 10003|Senior Engineer|1995-12-03|9999-01-01|
| 10004|       Engineer|1986-12-01|1995-12-01|
| 10004|Senior Engineer|1995-12-01|9999-01-01|
+------+---------------+----------+----------+

In [45]:
#lets find agg of title
spark.sql("select title,count(title) as total_emp from titles group by title order by total_emp desc").show()

+------------------+---------+
|             title|total_emp|
+------------------+---------+
|          Engineer|   115003|
|             Staff|   107391|
|   Senior Engineer|    97750|
|      Senior Staff|    92853|
|  Technique Leader|    15159|
|Assistant Engineer|    15128|
|           Manager|       24|
+------------------+---------+

In [ ]:
#lets dump this data into spreadsheet
# https://towardsdatascience.com/using-python-to-push-your-pandas-dataframe-to-google-sheets-de69422508f